YuZane/ExpressTrain/Device/MM32F5330/Include/reg_rcc.h
/***********************************************************************************************************************
    @file     reg_rcc.h
    @author   VV TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
              MM32 FIRMWARE LIBRARY.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_RCC_H
#define __REG_RCC_H

/* Files includes ------------------------------------------------------------*/
#include "core_starmc1.h"

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

/**
  * @brief RCC Base Address Definition
  */
#define RCC_BASE                        (AHB1PERIPH_BASE + 0x1000) /*!< Base Address: 0x40021000 */

/**
  * @brief RCC Register Structure Definition
  */
typedef struct
{
    __IO uint32_t CR;                  /*!< Control Register                               offset: 0x00 */
    __IO uint32_t CFGR;                /*!< Configuration Register                         offset: 0x04 */
    __IO uint32_t CIR;                 /*!< Clock Interrupt Register                       offset: 0x08 */
    __IO uint32_t RESERVED0x0C[2];     /*!< Reserved,                                      offset: 0x0C~0x10*/
    __IO uint32_t AHBRSTR;             /*!< AHB Peripheral Reset Register,                 offset: 0x14 */
    __IO uint32_t APB2RSTR;            /*!< APB2 Peripheral Reset Register,                offset: 0x18 */
    __IO uint32_t APB1RSTR;            /*!< APB1 Peripheral Reset Register,                offset: 0x1C */
    __IO uint32_t RESERVED0x20[2];     /*!< Reserved,                                      offset: 0x20~0x24 */
    __IO uint32_t AHBENR;              /*!< AHB Peripheral Clock Enable Register,          offset: 0x28 */
    __IO uint32_t APB2ENR;             /*!< APB2 Peripheral Clock Enable Register,         offset: 0x2C */
    __IO uint32_t APB1ENR;             /*!< APB1 Peripheral Clock Enable Register,         offset: 0x30 */
    __IO uint32_t BDCR;                /*!< Backup Domain Control Register,                offset: 0x34 */
    __IO uint32_t CSR;                 /*!< Control Status Register,                       offset: 0x38 */
    __IO uint32_t SYSCFGR;             /*!< System Configuration Register,                 offset: 0x3C */
    __IO uint32_t CFGR2;               /*!< Clock Configuration Register 2,                offset: 0x40 */
    __IO uint32_t ICSCR;               /*!< Internal Clock Source Calibration Register,    offset: 0x44 */
    __IO uint32_t PLL1CFGR;            /*!< PLL1 Configuration Register,                   offset: 0x48 */
    __IO uint32_t PLL2CFGR;            /*!< PLL2 Configuration Register,                   offset: 0x4C */
    __IO uint32_t RESERVED0x50[4];     /*!< Reserved,                                      offset: 0x50~0x5C */
    __IO uint32_t ADC1CFGR;            /*!< ADC1 Configuration Register,                   offset: 0x60 */
    __IO uint32_t ADC2CFGR;            /*!< ADC2 Configuration Register,                   offset: 0x64 */
    __IO uint32_t RESERVED0x68[2];     /*!< Reserved,                                      offset: 0x68~0x6C */
    __IO uint32_t DACCFGR;             /*!< DAC Configuration Register,                    offset: 0x70 */
    __IO uint32_t RESERVED0x74[2];     /*!< Reserved,                                      offset: 0x74~0x78 */
    __IO uint32_t TPIUCFGR;            /*!< TPIU Configuration Register,                   offset: 0x7C */
} RCC_TypeDef;

/**
  * @brief RCC type pointer Definition
  */
#define RCC                             ((RCC_TypeDef *)RCC_BASE)

/**
  * @brief RCC_CR Register Bit Definition
  */
#define RCC_CR_HSION_Pos                (0)
#define RCC_CR_HSION_Msk                (0x01U << RCC_CR_HSION_Pos)          /*!< Internal High Speed clock enable */

#define RCC_CR_HSIRDY_Pos               (1)
#define RCC_CR_HSIRDY_Msk               (0x01U << RCC_CR_HSIRDY_Pos)         /*!< Internal High Speed clock ready flag */

#define RCC_CR_HSELPFBYP_Pos            (4)
#define RCC_CR_HSELPFBYP_Msk            (0x01U << RCC_CR_HSELPFBYP_Pos)      /*!< LPF_IN direct output */
#define RCC_CR_HSELPFSEL_Pos            (5)
#define RCC_CR_HSELPFSEL_Msk            (0x01U << RCC_CR_HSELPFSEL_Pos)      /*!< Output after LPF filtering */
#define RCC_CR_HSEDEGLITCHBYP_Pos       (6)
#define RCC_CR_HSEDEGLITCHBYP_Msk       (0x01U << RCC_CR_HSEDEGLITCHBYP_Pos) /*!< Bypass deburring function */
#define RCC_CR_HSEDEGLITCHSEL_Pos       (7)
#define RCC_CR_HSEDEGLITCHSEL_Msk       (0x01U << RCC_CR_HSEDEGLITCHSEL_Pos) /*!< Deburring width 5nS */
#define RCC_CR_HSEOUTPUTSEL_Pos         (8)
#define RCC_CR_HSEOUTPUTSEL_Msk         (0x01U << RCC_CR_HSEOUTPUTSEL_Pos)   /*!< Filtered output */
#define RCC_CR_HSEDR_Pos                (9)
#define RCC_CR_HSEDR_Msk                (0x03U << RCC_CR_HSEDR_Pos)          /*!< HSE Driver Ability */

#define RCC_CR_HSIDIV_Pos               (11)
#define RCC_CR_HSIDIV_Msk               (0x07U << RCC_CR_HSIDIV_Pos)
#define RCC_CR_HSIDIV_1                 (0x00U << RCC_CR_HSIDIV_Pos)    /*!< HSI clock division 1   factor  */
#define RCC_CR_HSIDIV_2                 (0x01U << RCC_CR_HSIDIV_Pos)    /*!< HSI clock division 2   factor  */
#define RCC_CR_HSIDIV_4                 (0x02U << RCC_CR_HSIDIV_Pos)    /*!< HSI clock division 4   factor  */
#define RCC_CR_HSIDIV_8                 (0x03U << RCC_CR_HSIDIV_Pos)    /*!< HSI clock division 8   factor  */
#define RCC_CR_HSIDIV_16                (0x04U << RCC_CR_HSIDIV_Pos)    /*!< HSI clock division 16  factor  */
#define RCC_CR_HSIDIV_32                (0x05U << RCC_CR_HSIDIV_Pos)    /*!< HSI clock division 32  factor  */
#define RCC_CR_HSIDIV_64                (0x06U << RCC_CR_HSIDIV_Pos)    /*!< HSI clock division 64  factor  */
#define RCC_CR_HSIDIV_128               (0x07U << RCC_CR_HSIDIV_Pos)    /*!< HSI clock division 128 factor  */

