YuZane/ExpressTrain/Device/MM32F5330/Include/reg_rcc.h
#define RCC_CR_HSEON_Pos                (16)
#define RCC_CR_HSEON_Msk                (0x01U << RCC_CR_HSEON_Pos)     /*!< External High Speed clock enable */
#define RCC_CR_HSERDY_Pos               (17)
#define RCC_CR_HSERDY_Msk               (0x01U << RCC_CR_HSERDY_Pos)    /*!< External High Speed clock ready flag */
#define RCC_CR_HSEBYP_Pos               (18)
#define RCC_CR_HSEBYP_Msk               (0x01U << RCC_CR_HSEBYP_Pos)    /*!< External High Speed clock Bypass */
#define RCC_CR_CSSON_Pos                (19)
#define RCC_CR_CSSON_Msk                (0x01U << RCC_CR_CSSON_Pos)     /*!< Clock Security System enable */

#define RCC_CR_HSEAACSEL_Pos            (21)
#define RCC_CR_HSEAACSEL_Msk            (0x01U << RCC_CR_HSEAACSEL_Pos) /*!< HSE Amplitude Auto Calibration Selece */
#define RCC_CR_HSEIB_Pos                (22)
#define RCC_CR_HSEIB_Msk                (0x03U << RCC_CR_HSEIB_Pos)     /*!< HSE Current Mode Select */
#define RCC_CR_HSEIB_LOW                (0x00U << RCC_CR_HSEIB_Pos)     /*!< Low power mode */
#define RCC_CR_HSEIB_MID                (0x01U << RCC_CR_HSEIB_Pos)     /*!< Medium power mode */
#define RCC_CR_HSEIB_MID_HIGH           (0x02U << RCC_CR_HSEIB_Pos)     /*!< Medium-high power mode */
#define RCC_CR_HSEIB_HIGH               (0x03U << RCC_CR_HSEIB_Pos)     /*!< High power mode */

#define RCC_CR_PLL1ON_Pos               (24)
#define RCC_CR_PLL1ON_Msk               (0x01U << RCC_CR_PLL1ON_Pos)    /*!< PLL1 enable */
#define RCC_CR_PLL1RDY_Pos              (25)
#define RCC_CR_PLL1RDY_Msk              (0x01U << RCC_CR_PLL1RDY_Pos)   /*!< PLL1 clock ready flag */

#define RCC_CR_PLL2ON_Pos               (28)
#define RCC_CR_PLL2ON_Msk               (0x01U << RCC_CR_PLL2ON_Pos)    /*!< PLL2 enable */
#define RCC_CR_PLL2RDY_Pos              (29)
#define RCC_CR_PLL2RDY_Msk              (0x01U << RCC_CR_PLL2RDY_Pos)   /*!< PLL2 clock ready flag */

/**
  * @brief RCC_CFGR Register Bit Definition
  */
#define RCC_CFGR_SW_Pos                 (0)
#define RCC_CFGR_SW_Msk                 (0x03U << RCC_CFGR_SW_Pos)         /*!< SW[1:0] bits (System clock Switch) */

#define RCC_CFGR_SWS_Pos                (2)
#define RCC_CFGR_SWS_Msk                (0x03U << RCC_CFGR_SWS_Pos)        /*!< SWS[1:0] bits (System Clock Switch Status) */
#define RCC_CFGR_SWS_HSI                (0x00U << RCC_CFGR_SWS_Pos)        /*!< HSI/6 oscillator used as system clock */
#define RCC_CFGR_SWS_HSE                (0x01U << RCC_CFGR_SWS_Pos)        /*!< HSE oscillator used as system clock */
#define RCC_CFGR_SWS_PLL                (0x02U << RCC_CFGR_SWS_Pos)        /*!< PLL used as system clock */
#define RCC_CFGR_SWS_LSI                (0x03U << RCC_CFGR_SWS_Pos)        /*!< LSI used as system clock */

#define RCC_CFGR_HPRE_Pos               (4)
#define RCC_CFGR_HPRE_Msk               (0x0FU << RCC_CFGR_HPRE_Pos)       /*!< HPRE[3:0] bits (AHB prescaler) */
#define RCC_CFGR_HPRE_DIV1              (0x00U << RCC_CFGR_HPRE_Pos)       /*!< AHB = FCLK = SYSCLK not divided */
#define RCC_CFGR_HPRE_DIV2              (0x08U << RCC_CFGR_HPRE_Pos)       /*!< AHB = FCLK = SYSCLK divided by 2 */
#define RCC_CFGR_HPRE_DIV4              (0x09U << RCC_CFGR_HPRE_Pos)       /*!< AHB = FCLK = SYSCLK divided by 4 */
#define RCC_CFGR_HPRE_DIV8              (0x0AU << RCC_CFGR_HPRE_Pos)       /*!< AHB = FCLK = SYSCLK divided by 8 */
#define RCC_CFGR_HPRE_DIV16             (0x0BU << RCC_CFGR_HPRE_Pos)       /*!< AHB = FCLK = SYSCLK divided by 16 */
#define RCC_CFGR_HPRE_DIV64             (0x0CU << RCC_CFGR_HPRE_Pos)       /*!< AHB = FCLK = SYSCLK divided by 64 */
#define RCC_CFGR_HPRE_DIV128            (0x0DU << RCC_CFGR_HPRE_Pos)       /*!< AHB = FCLK = SYSCLK divided by 128 */
#define RCC_CFGR_HPRE_DIV256            (0x0EU << RCC_CFGR_HPRE_Pos)       /*!< AHB = FCLK = SYSCLK divided by 256 */
#define RCC_CFGR_HPRE_DIV512            (0x0FU << RCC_CFGR_HPRE_Pos)       /*!< AHB = FCLK = SYSCLK divided by 512 */

#define RCC_CFGR_PPRE1_Pos              (8)
#define RCC_CFGR_PPRE1_Msk              (0x07U << RCC_CFGR_PPRE1_Pos)      /*!< PRE1[2:0] bits (APB1 prescaler) */
#define RCC_CFGR_PPRE1_DIV1             (0x00U << RCC_CFGR_PPRE1_Pos)      /*!< APB1 = HCLK not divided */
#define RCC_CFGR_PPRE1_DIV32            (0x01U << RCC_CFGR_PPRE1_Pos)      /*!< APB1 = HCLK divided by 32 */
#define RCC_CFGR_PPRE1_DIV2             (0x04U << RCC_CFGR_PPRE1_Pos)      /*!< APB1 = HCLK divided by 2 */
#define RCC_CFGR_PPRE1_DIV4             (0x05U << RCC_CFGR_PPRE1_Pos)      /*!< APB1 = HCLK divided by 4 */
#define RCC_CFGR_PPRE1_DIV8             (0x06U << RCC_CFGR_PPRE1_Pos)      /*!< APB1 = HCLK divided by 8 */
#define RCC_CFGR_PPRE1_DIV16            (0x07U << RCC_CFGR_PPRE1_Pos)      /*!< APB1 = HCLK divided by 16 */

#define RCC_CFGR_PPRE2_Pos              (11)
#define RCC_CFGR_PPRE2_Msk              (0x07U << RCC_CFGR_PPRE2_Pos)      /*!< PRE2[2:0] bits (APB2 prescaler) */
#define RCC_CFGR_PPRE2_DIV1             (0x00U << RCC_CFGR_PPRE2_Pos)      /*!< APB2 = HCLK not divided */
#define RCC_CFGR_PPRE2_DIV32            (0x01U << RCC_CFGR_PPRE2_Pos)      /*!< APB2 = HCLK divided by 32 */
#define RCC_CFGR_PPRE2_DIV2             (0x04U << RCC_CFGR_PPRE2_Pos)      /*!< APB2 = HCLK divided by 2 */
#define RCC_CFGR_PPRE2_DIV4             (0x05U << RCC_CFGR_PPRE2_Pos)      /*!< APB2 = HCLK divided by 4 */
#define RCC_CFGR_PPRE2_DIV8             (0x06U << RCC_CFGR_PPRE2_Pos)      /*!< APB2 = HCLK divided by 8 */
#define RCC_CFGR_PPRE2_DIV16            (0x07U << RCC_CFGR_PPRE2_Pos)      /*!< APB2 = HCLK divided by 16 */

#define RCC_CFGR_ADC1CLKSEL_Pos         (16)
#define RCC_CFGR_ADC1CLKSEL_Msk         (0x01U << RCC_CFGR_ADC1CLKSEL_Pos) /*!< Select ADC1CLK Clock Source */
#define RCC_CFGR_ADC2CLKSEL_Pos         (17)
#define RCC_CFGR_ADC2CLKSEL_Msk         (0x01U << RCC_CFGR_ADC2CLKSEL_Pos) /*!< Select ADC2CLK Clock Source */

#define RCC_CFGR_USBCLKSEL_Pos          (19)
#define RCC_CFGR_USBCLKSEL_Msk          (0x01U << RCC_CFGR_USBCLKSEL_Pos)  /*!< Select USBCLK Clock Source */

