YuZane/ExpressTrain/Device/MM32F5330/Include/reg_rcc.h
#define RCC_CFGR_USBPRE_Pos             (22)
#define RCC_CFGR_USBPRE_Msk             (0x03U << RCC_CFGR_USBPRE_Pos)     /*!< USB Prescaler */
#define RCC_CFGR_USBPRE_1               (0x00U << RCC_CFGR_USBPRE_Pos)     /*!< PLL1/PLL2 clock directly as USB_FS clock */
#define RCC_CFGR_USBPRE_2               (0x01U << RCC_CFGR_USBPRE_Pos)     /*!< PLL1/PLL2 clock 2 division as USB_FS clock */
#define RCC_CFGR_USBPRE_3               (0x02U << RCC_CFGR_USBPRE_Pos)     /*!< PLL1/PLL2 clock 3 division as USB_FS clock */
#define RCC_CFGR_USBPRE_4               (0x03U << RCC_CFGR_USBPRE_Pos)     /*!< PLL1/PLL2 clock 4 division as USB_FS clock */

#define RCC_CFGR_MCO_Pos                (24)
#define RCC_CFGR_MCO_Msk                (0x0FU << RCC_CFGR_MCO_Pos)        /*!< MCO[2:0] bits (Microcontroller Clock Output) */
#define RCC_CFGR_MCO_NOCLOCK            (0x00U << RCC_CFGR_MCO_Pos)        /*!< No clock */
#define RCC_CFGR_MCO_LSI                (0x02U << RCC_CFGR_MCO_Pos)        /*!< LSI clock */
#define RCC_CFGR_MCO_LSE                (0x03U << RCC_CFGR_MCO_Pos)        /*!< LSE clock */
#define RCC_CFGR_MCO_SYSCLK             (0x04U << RCC_CFGR_MCO_Pos)        /*!< System clock selected */
#define RCC_CFGR_MCO_HSI                (0x05U << RCC_CFGR_MCO_Pos)        /*!< Internal 48 MHz RC oscillator clock selected */
#define RCC_CFGR_MCO_HSE                (0x06U << RCC_CFGR_MCO_Pos)        /*!< External 1-25 MHz oscillator clock selected */
#define RCC_CFGR_MCO_PLL1               (0x07U << RCC_CFGR_MCO_Pos)        /*!< PLL clock divided by 2 selected */
#define RCC_CFGR_MCO_PLL2               (0x08U << RCC_CFGR_MCO_Pos)        /*!< PLL clock divided by 2 selected */

/**
  * @brief RCC_CIR Register Bit Definition
  */
#define RCC_CIR_LSIRDYF_Pos             (0)
#define RCC_CIR_LSIRDYF_Msk             (0x01U << RCC_CIR_LSIRDYF_Pos)   /*!< LSI Ready Interrupt flag */

#define RCC_CIR_LSERDYF_Pos             (1)
#define RCC_CIR_LSERDYF_Msk             (0x01U << RCC_CIR_LSERDYF_Pos)   /*!< LSE Ready Interrupt flag */

#define RCC_CIR_HSIRDYF_Pos             (2)
#define RCC_CIR_HSIRDYF_Msk             (0x01U << RCC_CIR_HSIRDYF_Pos)   /*!< HSI Ready Interrupt flag */
#define RCC_CIR_HSERDYF_Pos             (3)
#define RCC_CIR_HSERDYF_Msk             (0x01U << RCC_CIR_HSERDYF_Pos)   /*!< HSE Ready Interrupt flag */

#define RCC_CIR_PLL1RDYF_Pos            (4)
#define RCC_CIR_PLL1RDYF_Msk            (0x01U << RCC_CIR_PLL1RDYF_Pos)  /*!< PLL1 Ready Interrupt flag */
#define RCC_CIR_PLL2RDYF_Pos            (5)
#define RCC_CIR_PLL2RDYF_Msk            (0x01U << RCC_CIR_PLL2RDYF_Pos)  /*!< PLL2 Ready Interrupt flag */

#define RCC_CIR_CSSF_Pos                (7)
#define RCC_CIR_CSSF_Msk                (0x01U << RCC_CIR_CSSF_Pos)      /*!< Clock Security System Interrupt flag */
#define RCC_CIR_LSIRDYIE_Pos            (8)
#define RCC_CIR_LSIRDYIE_Msk            (0x01U << RCC_CIR_LSIRDYIE_Pos)  /*!< LSI Ready Interrupt Enable */

#define RCC_CIR_LSERDYIE_Pos            (9)
#define RCC_CIR_LSERDYIE_Msk            (0x01U << RCC_CIR_LSERDYIE_Pos)  /*!< LSE Ready Interrupt Enable */

#define RCC_CIR_HSIRDYIE_Pos            (10)
#define RCC_CIR_HSIRDYIE_Msk            (0x01U << RCC_CIR_HSIRDYIE_Pos)  /*!< HSI Ready Interrupt Enable */
#define RCC_CIR_HSERDYIE_Pos            (11)
#define RCC_CIR_HSERDYIE_Msk            (0x01U << RCC_CIR_HSERDYIE_Pos)  /*!< HSE Ready Interrupt Enable */

#define RCC_CIR_PLL1RDYIE_Pos           (12)
#define RCC_CIR_PLL1RDYIE_Msk           (0x01U << RCC_CIR_PLL1RDYIE_Pos) /*!< PLL Ready Interrupt Enable */
#define RCC_CIR_PLL2RDYIE_Pos           (13)
#define RCC_CIR_PLL2RDYIE_Msk           (0x01U << RCC_CIR_PLL2RDYIE_Pos) /*!< PLL Ready Interrupt Enable */

#define RCC_CIR_LSIRDYC_Pos             (16)
#define RCC_CIR_LSIRDYC_Msk             (0x01U << RCC_CIR_LSIRDYC_Pos)   /*!< LSI Ready Interrupt Clear */

#define RCC_CIR_LSERDYC_Pos             (17)
#define RCC_CIR_LSERDYC_Msk             (0x01U << RCC_CIR_LSERDYC_Pos)   /*!< LSE Ready Interrupt Clear */

#define RCC_CIR_HSIRDYC_Pos             (18)
#define RCC_CIR_HSIRDYC_Msk             (0x01U << RCC_CIR_HSIRDYC_Pos)   /*!< HSI Ready Interrupt Clear */
#define RCC_CIR_HSERDYC_Pos             (19)
#define RCC_CIR_HSERDYC_Msk             (0x01U << RCC_CIR_HSERDYC_Pos)   /*!< HSE Ready Interrupt Clear */

#define RCC_CIR_PLL1RDYC_Pos            (20)
#define RCC_CIR_PLL1RDYC_Msk            (0x01U << RCC_CIR_PLL1RDYC_Pos)  /*!< PLL Ready Interrupt Clear */
#define RCC_CIR_PLL2RDYC_Pos            (21)
#define RCC_CIR_PLL2RDYC_Msk            (0x01U << RCC_CIR_PLL2RDYC_Pos)  /*!< PLL Ready Interrupt Clear */

#define RCC_CIR_CSSC_Pos                (23)
#define RCC_CIR_CSSC_Msk                (0x01U << RCC_CIR_CSSC_Pos)      /*!< Clock Security System Interrupt Clear */

/**
  * @brief RCC_AHBRSTR Register Bit Definition
  */
#define RCC_AHBRSTR_GPIOA_Pos           (0)
#define RCC_AHBRSTR_GPIOA_Msk           (0x01U << RCC_AHBRSTR_GPIOA_Pos)  /*!< GPIOA Reset */
#define RCC_AHBRSTR_GPIOB_Pos           (1)
#define RCC_AHBRSTR_GPIOB_Msk           (0x01U << RCC_AHBRSTR_GPIOB_Pos)  /*!< GPIOB Reset */
#define RCC_AHBRSTR_GPIOC_Pos           (2)
#define RCC_AHBRSTR_GPIOC_Msk           (0x01U << RCC_AHBRSTR_GPIOC_Pos)  /*!< GPIOC Reset */
#define RCC_AHBRSTR_GPIOD_Pos           (3)
#define RCC_AHBRSTR_GPIOD_Msk           (0x01U << RCC_AHBRSTR_GPIOD_Pos)  /*!< GPIOD Reset */

#define RCC_AHBRSTR_GPIOH_Pos           (7)
#define RCC_AHBRSTR_GPIOH_Msk           (0x01U << RCC_AHBRSTR_GPIOH_Pos)  /*!< GPIOH Reset */
#define RCC_AHBRSTR_GPIOI_Pos           (8)
#define RCC_AHBRSTR_GPIOI_Msk           (0x01U << RCC_AHBRSTR_GPIOI_Pos)  /*!< GPIOI Reset */

#define RCC_AHBRSTR_CRC_Pos             (12)
#define RCC_AHBRSTR_CRC_Msk             (0x01U << RCC_AHBRSTR_CRC_Pos)    /*!< CRC Reset */

#define RCC_AHBRSTR_CORDIC_Pos          (15)
#define RCC_AHBRSTR_CORDIC_Msk          (0x01U << RCC_AHBRSTR_CORDIC_Pos) /*!< CORDIC Reset */

#define RCC_AHBRSTR_DMA1_Pos            (21)
#define RCC_AHBRSTR_DMA1_Msk            (0x01U << RCC_AHBRSTR_DMA1_Pos)   /*!< DMA1 Reset */
#define RCC_AHBRSTR_DMA2_Pos            (22)
#define RCC_AHBRSTR_DMA2_Msk            (0x01U << RCC_AHBRSTR_DMA2_Pos)   /*!< DMA2 Reset */

