YuZane/ExpressTrain/Device/MM32F5330/Include/reg_rcc.h
#define RCC_AHBRSTR_USB_FS_Pos          (24)
#define RCC_AHBRSTR_USB_FS_Msk          (0x01U << RCC_AHBRSTR_USB_FS_Pos) /*!< USB_FS Reset */

/**
  * @brief RCC_APB2RSTR Register Bit Definition
  */
#define RCC_APB2RSTR_TIM1_Pos           (0)
#define RCC_APB2RSTR_TIM1_Msk           (0x01U << RCC_APB2RSTR_TIM1_Pos)   /*!< TIM1 Reset */
#define RCC_APB2RSTR_TIM8_Pos           (1)
#define RCC_APB2RSTR_TIM8_Msk           (0x01U << RCC_APB2RSTR_TIM8_Pos)   /*!< TIM8 Reset */

#define RCC_APB2RSTR_UART1_Pos          (4)
#define RCC_APB2RSTR_UART1_Msk          (0x01U << RCC_APB2RSTR_UART1_Pos)  /*!< UART1 Reset */

#define RCC_APB2RSTR_ADC1_Pos           (8)
#define RCC_APB2RSTR_ADC1_Msk           (0x01U << RCC_APB2RSTR_ADC1_Pos)   /*!< ADC1 interface reset */
#define RCC_APB2RSTR_ADC2_Pos           (9)
#define RCC_APB2RSTR_ADC2_Msk           (0x01U << RCC_APB2RSTR_ADC2_Pos)   /*!< ADC2 interface reset */

#define RCC_APB2RSTR_SPI1_Pos           (12)
#define RCC_APB2RSTR_SPI1_Msk           (0x01U << RCC_APB2RSTR_SPI1_Pos)   /*!< SPI 1 reset */
#define RCC_APB2RSTR_SYSCFG_Pos         (14)
#define RCC_APB2RSTR_SYSCFG_Msk         (0x01U << RCC_APB2RSTR_SYSCFG_Pos) /*!< SYSCFG Reset */

#define RCC_APB2RSTR_COMP_Pos           (15)
#define RCC_APB2RSTR_COMP_Msk           (0x01U << RCC_APB2RSTR_COMP_Pos)   /*!< COMP interface reset */

#define RCC_APB2RSTR_USART_Pos          (20)
#define RCC_APB2RSTR_USART_Msk          (0x01U << RCC_APB2RSTR_USART_Pos)  /*!< RCC_APB2RSTR_USART_Pos */

#define RCC_APB2RSTR_MDS_Pos            (28)
#define RCC_APB2RSTR_MDS_Msk            (0x01U << RCC_APB2RSTR_MDS_Pos)    /*!< MDS Reset */

#define RCC_APB2RSTR_LPTIM_Pos          (30)
#define RCC_APB2RSTR_LPTIM_Msk          (0x01U << RCC_APB2RSTR_LPTIM_Pos)  /*!< LPTIM Reset */
#define RCC_APB2RSTR_LPUART_Pos         (31)
#define RCC_APB2RSTR_LPUART_Msk         (0x01U << RCC_APB2RSTR_LPUART_Pos) /*!< LPUART Reset */

/**
  * @brief RCC_APB1RSTR Register Bit Definition
  */
#define RCC_APB1RSTR_TIM2_Pos           (0)
#define RCC_APB1RSTR_TIM2_Msk           (0x01U << RCC_APB1RSTR_TIM2_Pos)    /*!< Timer 2 reset */
#define RCC_APB1RSTR_TIM3_Pos           (1)
#define RCC_APB1RSTR_TIM3_Msk           (0x01U << RCC_APB1RSTR_TIM3_Pos)    /*!< Timer 3 reset */
#define RCC_APB1RSTR_TIM4_Pos           (2)
#define RCC_APB1RSTR_TIM4_Msk           (0x01U << RCC_APB1RSTR_TIM4_Pos)    /*!< Timer 4 reset */
#define RCC_APB1RSTR_TIM5_Pos           (3)
#define RCC_APB1RSTR_TIM5_Msk           (0x01U << RCC_APB1RSTR_TIM5_Pos)    /*!< Timer 5 reset */
#define RCC_APB1RSTR_TIM6_Pos           (4)
#define RCC_APB1RSTR_TIM6_Msk           (0x01U << RCC_APB1RSTR_TIM6_Pos)    /*!< Timer 6 reset */
#define RCC_APB1RSTR_TIM7_Pos           (5)
#define RCC_APB1RSTR_TIM7_Msk           (0x01U << RCC_APB1RSTR_TIM7_Pos)    /*!< Timer 7 reset */

#define RCC_APB1RSTR_I3C_Pos            (8)
#define RCC_APB1RSTR_I3C_Msk            (0x01U << RCC_APB1RSTR_I3C_Pos)     /*!< TI3C reset */

#define RCC_APB1RSTR_WWDG_Pos           (11)
#define RCC_APB1RSTR_WWDG_Msk           (0x01U << RCC_APB1RSTR_WWDG_Pos)    /*!< Window Watchdog reset */

#define RCC_APB1RSTR_SPI2_Pos           (14)
#define RCC_APB1RSTR_SPI2_Msk           (0x01U << RCC_APB1RSTR_SPI2_Pos)    /*!< SPI 2 reset */
#define RCC_APB1RSTR_SPI3_Pos           (15)
#define RCC_APB1RSTR_SPI3_Msk           (0x01U << RCC_APB1RSTR_SPI3_Pos)    /*!< SPI 3 reset */

#define RCC_APB1RSTR_UART2_Pos          (17)
#define RCC_APB1RSTR_UART2_Msk          (0x01U << RCC_APB1RSTR_UART2_Pos)   /*!< UART 2 reset */
#define RCC_APB1RSTR_UART3_Pos          (18)
#define RCC_APB1RSTR_UART3_Msk          (0x01U << RCC_APB1RSTR_UART3_Pos)   /*!< UART 3 reset */
#define RCC_APB1RSTR_UART4_Pos          (19)
#define RCC_APB1RSTR_UART4_Msk          (0x01U << RCC_APB1RSTR_UART4_Pos)   /*!< UART 4 reset */

#define RCC_APB1RSTR_I2C1_Pos           (21)
#define RCC_APB1RSTR_I2C1_Msk           (0x01U << RCC_APB1RSTR_I2C1_Pos)    /*!< I2C 1 reset */
#define RCC_APB1RSTR_I2C2_Pos           (22)
#define RCC_APB1RSTR_I2C2_Msk           (0x01U << RCC_APB1RSTR_I2C2_Pos)    /*!< I2C 2 reset */

#define RCC_APB1RSTR_CRS_Pos            (24)
#define RCC_APB1RSTR_CRS_Msk            (0x01U << RCC_APB1RSTR_CRS_Pos)     /*!< CRS Reset */
#define RCC_APB1RSTR_FLEXCAN_Pos        (25)
#define RCC_APB1RSTR_FLEXCAN_Msk        (0x01U << RCC_APB1RSTR_FLEXCAN_Pos) /*!< FLEXCAN Reset */

#define RCC_APB1RSTR_DBG_Pos            (26)
#define RCC_APB1RSTR_DBG_Msk            (0x01U << RCC_APB1RSTR_DBG_Pos)     /*!< DBG Reset */
#define RCC_APB1RSTR_BKP_Pos            (27)
#define RCC_APB1RSTR_BKP_Msk            (0x01U << RCC_APB1RSTR_BKP_Pos)     /*!< BKP Reset */
#define RCC_APB1RSTR_PWR_Pos            (28)
#define RCC_APB1RSTR_PWR_Msk            (0x01U << RCC_APB1RSTR_PWR_Pos)     /*!< Power interface reset */
#define RCC_APB1RSTR_DAC_Pos            (29)
#define RCC_APB1RSTR_DAC_Msk            (0x01U << RCC_APB1RSTR_DAC_Pos)     /*!< DAC Reset */

/**
  * @brief RCC_AHBENR Register Bit Definition
  */
#define RCC_AHBENR_GPIOA_Pos            (0)
#define RCC_AHBENR_GPIOA_Msk            (0x01U << RCC_AHBENR_GPIOA_Pos)  /*!< GPIOA CLOCK ENABLE */
#define RCC_AHBENR_GPIOB_Pos            (1)
#define RCC_AHBENR_GPIOB_Msk            (0x01U << RCC_AHBENR_GPIOB_Pos)  /*!< GPIOB CLOCK ENABLE */
#define RCC_AHBENR_GPIOC_Pos            (2)
#define RCC_AHBENR_GPIOC_Msk            (0x01U << RCC_AHBENR_GPIOC_Pos)  /*!< GPIOC CLOCK ENABLE */
#define RCC_AHBENR_GPIOD_Pos            (3)
#define RCC_AHBENR_GPIOD_Msk            (0x01U << RCC_AHBENR_GPIOD_Pos)  /*!< GPIOD CLOCK ENABLE */

#define RCC_AHBENR_GPIOH_Pos            (7)
#define RCC_AHBENR_GPIOH_Msk            (0x01U << RCC_AHBENR_GPIOH_Pos)  /*!< GPIOH CLOCK ENABLE */
#define RCC_AHBENR_GPIOI_Pos            (8)
#define RCC_AHBENR_GPIOI_Msk            (0x01U << RCC_AHBENR_GPIOI_Pos)  /*!< GPIOI CLOCK ENABLE */

#define RCC_AHBENR_CRC_Pos              (12)
#define RCC_AHBENR_CRC_Msk              (0x01U << RCC_AHBENR_CRC_Pos)    /*!< CRC CLOCK ENABLE */
#define RCC_AHBENR_FLASH_Pos            (13)
#define RCC_AHBENR_FLASH_Msk            (0x01U << RCC_AHBENR_FLASH_Pos)  /*!< FLASH CLOCK ENABLE */
#define RCC_AHBENR_SRAM_Pos             (14)
#define RCC_AHBENR_SRAM_Msk             (0x01U << RCC_AHBENR_SRAM_Pos)   /*!< SRAM CLOCK ENABLE */
#define RCC_AHBENR_CORDIC_Pos           (15)
#define RCC_AHBENR_CORDIC_Msk           (0x01U << RCC_AHBENR_CORDIC_Pos) /*!< CORDIC CLOCK ENABLE */

