YuZane/ExpressTrain/Device/MM32F5330/Include/reg_rcc.h
#define RCC_AHBENR_DMA1_Pos             (21)
#define RCC_AHBENR_DMA1_Msk             (0x01U << RCC_AHBENR_DMA1_Pos)   /*!< DMA1 CLOCK ENABLE */
#define RCC_AHBENR_DMA2_Pos             (22)
#define RCC_AHBENR_DMA2_Msk             (0x01U << RCC_AHBENR_DMA2_Pos)   /*!< DMA2 CLOCK ENABLE */

#define RCC_AHBENR_USB_FS_Pos           (24)
#define RCC_AHBENR_USB_FS_Msk           (0x01U << RCC_AHBENR_USB_FS_Pos) /*!< USB_FS CLOCK ENABLE */

/**
  * @brief RCC_APB2ENR Register Bit Definition
  */
#define RCC_APB2ENR_TIM1_Pos            (0)
#define RCC_APB2ENR_TIM1_Msk            (0x01U << RCC_APB2ENR_TIM1_Pos)   /*!< TIM1 Clock enable */
#define RCC_APB2ENR_TIM8_Pos            (1)
#define RCC_APB2ENR_TIM8_Msk            (0x01U << RCC_APB2ENR_TIM8_Pos)   /*!< TIM8 CLOCK ENABLE */

#define RCC_APB2ENR_UART1_Pos           (4)
#define RCC_APB2ENR_UART1_Msk           (0x01U << RCC_APB2ENR_UART1_Pos)  /*!< UART1 CLOCK ENABLE */

#define RCC_APB2ENR_ADC1_Pos            (8)
#define RCC_APB2ENR_ADC1_Msk            (0x01U << RCC_APB2ENR_ADC1_Pos)   /*!< ADC1 Interface CLOCK ENABLE */
#define RCC_APB2ENR_ADC2_Pos            (9)
#define RCC_APB2ENR_ADC2_Msk            (0x01U << RCC_APB2ENR_ADC2_Pos)   /*!< ADC2 Interface CLOCK ENABLE */

#define RCC_APB2ENR_SPI1_Pos            (12)
#define RCC_APB2ENR_SPI1_Msk            (0x01U << RCC_APB2ENR_SPI1_Pos)   /*!< SPI1 CLOCK ENABLE */

#define RCC_APB2ENR_SYSCFG_Pos          (14)
#define RCC_APB2ENR_SYSCFG_Msk          (0x01U << RCC_APB2ENR_SYSCFG_Pos) /*!< SYSCFG CLOCK ENABLE */
#define RCC_APB2ENR_COMP_Pos            (15)
#define RCC_APB2ENR_COMP_Msk            (0x01U << RCC_APB2ENR_COMP_Pos)   /*!< COMP CLOCK ENABLE */

#define RCC_APB2ENR_USART_Pos           (20)
#define RCC_APB2ENR_USART_Msk           (0x01U << RCC_APB2ENR_USART_Pos)  /*!< USART CLOCK ENABLE */

#define RCC_APB2ENR_MDS_Pos             (28)
#define RCC_APB2ENR_MDS_Msk             (0x01U << RCC_APB2ENR_MDS_Pos)    /*!< MDS CLOCK ENABLE */

#define RCC_APB2ENR_LPTIM_Pos           (30)
#define RCC_APB2ENR_LPTIM_Msk           (0x01U << RCC_APB2ENR_LPTIM_Pos)  /*!< LPTIM CLOCK ENABLE */
#define RCC_APB2ENR_LPUART_Pos          (31)
#define RCC_APB2ENR_LPUART_Msk          (0x01U << RCC_APB2ENR_LPUART_Pos) /*!< LPUART CLOCK ENABLE */

/**
  * @brief RCC_APB1ENR Register Bit Definition
  */
#define RCC_APB1ENR_TIM2_Pos            (0)
#define RCC_APB1ENR_TIM2_Msk            (0x01U << RCC_APB1ENR_TIM2_Pos)    /*!< TIM2 CLOCK ENABLE */
#define RCC_APB1ENR_TIM3_Pos            (1)
#define RCC_APB1ENR_TIM3_Msk            (0x01U << RCC_APB1ENR_TIM3_Pos)    /*!< TIM3 CLOCK ENABLE */
#define RCC_APB1ENR_TIM4_Pos            (2)
#define RCC_APB1ENR_TIM4_Msk            (0x01U << RCC_APB1ENR_TIM4_Pos)    /*!< TIM4 CLOCK ENABLE */
#define RCC_APB1ENR_TIM5_Pos            (3)
#define RCC_APB1ENR_TIM5_Msk            (0x01U << RCC_APB1ENR_TIM5_Pos)    /*!< TIM5 CLOCK ENABLE */
#define RCC_APB1ENR_TIM6_Pos            (4)
#define RCC_APB1ENR_TIM6_Msk            (0x01U << RCC_APB1ENR_TIM6_Pos)    /*!< TIM6 CLOCK ENABLE */
#define RCC_APB1ENR_TIM7_Pos            (5)
#define RCC_APB1ENR_TIM7_Msk            (0x01U << RCC_APB1ENR_TIM7_Pos)    /*!< TIM7 CLOCK ENABLE */

#define RCC_APB1ENR_I3C_Pos             (8)
#define RCC_APB1ENR_I3C_Msk             (0x01U << RCC_APB1ENR_I3C_Pos)     /*!< I3C CLOCK ENABLE */

#define RCC_APB1ENR_WWDG_Pos            (11)
#define RCC_APB1ENR_WWDG_Msk            (0x01U << RCC_APB1ENR_WWDG_Pos)    /*!< Window Watchdog CLOCK ENABLE*/

#define RCC_APB1ENR_SPI2_Pos            (14)
#define RCC_APB1ENR_SPI2_Msk            (0x01U << RCC_APB1ENR_SPI2_Pos)    /*!< SPI2 CLOCK ENABLE */
#define RCC_APB1ENR_SPI3_Pos            (15)
#define RCC_APB1ENR_SPI3_Msk            (0x01U << RCC_APB1ENR_SPI3_Pos)    /*!< SPI3 CLOCK ENABLE */

#define RCC_APB1ENR_UART2_Pos           (17)
#define RCC_APB1ENR_UART2_Msk           (0x01U << RCC_APB1ENR_UART2_Pos)   /*!< UART2 CLOCK ENABLE */
#define RCC_APB1ENR_UART3_Pos           (18)
#define RCC_APB1ENR_UART3_Msk           (0x01U << RCC_APB1ENR_UART3_Pos)   /*!< UART3 CLOCK ENABLE */
#define RCC_APB1ENR_UART4_Pos           (19)
#define RCC_APB1ENR_UART4_Msk           (0x01U << RCC_APB1ENR_UART4_Pos)   /*!< UART4 CLOCK ENABLE*/

#define RCC_APB1ENR_I2C1_Pos            (21)
#define RCC_APB1ENR_I2C1_Msk            (0x01U << RCC_APB1ENR_I2C1_Pos)    /*!< I2C CLOCK ENABLE */
#define RCC_APB1ENR_I2C2_Pos            (22)
#define RCC_APB1ENR_I2C2_Msk            (0x01U << RCC_APB1ENR_I2C2_Pos)    /*!, I2C2 CLOCK ENANE */

#define RCC_APB1ENR_CRS_Pos             (24)
#define RCC_APB1ENR_CRS_Msk             (0x01U << RCC_APB1ENR_CRS_Pos)     /*!< CRS CLOCK ENABEE */
#define RCC_APB1ENR_FLEXCAN_Pos         (25)
#define RCC_APB1ENR_FLEXCAN_Msk         (0x01U << RCC_APB1ENR_FLEXCAN_Pos) /*!< FLEXCAN CLOCK ENABLE */

#define RCC_APB1ENR_BKP_Pos             (27)
#define RCC_APB1ENR_BKP_Msk             (0x01U << RCC_APB1ENR_BKP_Pos)     /*!< BKP CLOCK ENABLE */
#define RCC_APB1ENR_PWR_DBG_Pos         (28)
#define RCC_APB1ENR_PWR_DBG_Msk         (0x01U << RCC_APB1ENR_PWR_DBG_Pos) /*!< PWR/DBG CLOCK ENABLE */
#define RCC_APB1ENR_DAC_Pos             (29)
#define RCC_APB1ENR_DAC_Msk             (0x01U << RCC_APB1ENR_DAC_Pos)     /*!< DAC CLOCK ENABLE */

/**
  * @brief RCC_BDCR Register Bit Definition
  */
#define RCC_BDCR_LSEON_Pos              (0)
#define RCC_BDCR_LSEON_Msk              (0x01U << RCC_BDCR_LSEON_Pos)  /*!< External Low-speed Oscillator Enable */
#define RCC_BDCR_LSERDY_Pos             (1)
#define RCC_BDCR_LSERDY_Msk             (0x01U << RCC_BDCR_LSERDY_Pos) /*!< External Low-speed Oscillator Ready */
#define RCC_BDCR_LSEBYP_Pos             (2)
#define RCC_BDCR_LSEBYP_Msk             (0x01U << RCC_BDCR_LSEBYP_Pos) /*!< External Low-speed Oscillator Bypass */

#define RCC_BDCR_RTCSEL_Pos             (8)
#define RCC_BDCR_RTCSEL_Msk             (0x03U << RCC_BDCR_RTCSEL_Pos) /*!< RTC Clock Source Selection */

#define RCC_BDCR_RTCEN_Pos              (15)
#define RCC_BDCR_RTCEN_Msk              (0x01U << RCC_BDCR_RTCEN_Pos)  /*!< RTC Clock Enable */
#define RCC_BDCR_BDRST_Pos              (16)
#define RCC_BDCR_BDRST_Msk              (0x01U << RCC_BDCR_BDRST_Pos)  /*!< Backup Domain Software Reset */

