YuZane/ExpressTrain/Device/MM32F5330/Include/reg_rcc.h
#define RCC_BDCR_DBP_Pos                (24)
#define RCC_BDCR_DBP_Msk                (0x01U << RCC_BDCR_DBP_Pos)    /*!< Disable backup area write protection */

/**
  * @brief RCC_CSR Register Bit Definition
  */
#define RCC_CSR_LSION_Pos               (0)
#define RCC_CSR_LSION_Msk               (0x01U << RCC_CSR_LSION_Pos)    /*!< Internal Low Speed oscillator enable */
#define RCC_CSR_LSIRDY_Pos              (1)
#define RCC_CSR_LSIRDY_Msk              (0x01U << RCC_CSR_LSIRDY_Pos)   /*!< Internal Low Speed oscillator Ready */

#define RCC_CSR_LSIOE_Pos               (5)
#define RCC_CSR_LSIOE_Msk               (0x01U << RCC_CSR_LSIOE_Pos)    /*!< LSI output enable */
#define RCC_CSR_PVDRSTEN_Pos            (6)
#define RCC_CSR_PVDRSTEN_Msk            (0x01U << RCC_CSR_PVDRSTEN_Pos) /*!< PVD reset enable */
#define RCC_CSR_LOCKUPEN_Pos            (7)
#define RCC_CSR_LOCKUPEN_Msk            (0x01U << RCC_CSR_LOCKUPEN_Pos) /*!< CPU LOCK reset enable */

#define RCC_CSR_PVDRSTF_Pos             (22)
#define RCC_CSR_PVDRSTF_Msk             (0x01U << RCC_CSR_PVDRSTF_Pos)  /*!< PVD reset flag */
#define RCC_CSR_LOCKUPF_Pos             (23)
#define RCC_CSR_LOCKUPF_Msk             (0x01U << RCC_CSR_LOCKUPF_Pos)  /*!< CPU lockup reset flag */

#define RCC_CSR_RMVF_Pos                (24)
#define RCC_CSR_RMVF_Msk                (0x01U << RCC_CSR_RMVF_Pos)     /*!< Remove reset flag */
#define RCC_CSR_PINRSTF_Pos             (26)
#define RCC_CSR_PINRSTF_Msk             (0x01U << RCC_CSR_PINRSTF_Pos)  /*!< PIN reset flag */

#define RCC_CSR_PORRSTF_Pos             (27)
#define RCC_CSR_PORRSTF_Msk             (0x01U << RCC_CSR_PORRSTF_Pos)  /*!< POR/PDR reset flag */

#define RCC_CSR_SFTRSTF_Pos             (28)
#define RCC_CSR_SFTRSTF_Msk             (0x01U << RCC_CSR_SFTRSTF_Pos)  /*!< Software Reset flag */

#define RCC_CSR_IWDGRSTF_Pos            (29)
#define RCC_CSR_IWDGRSTF_Msk            (0x01U << RCC_CSR_IWDGRSTF_Pos) /*!< Independent Watchdog reset flag */

#define RCC_CSR_WWDGRSTF_Pos            (30)
#define RCC_CSR_WWDGRSTF_Msk            (0x01U << RCC_CSR_WWDGRSTF_Pos) /*!< Window watchdog reset flag */
#define RCC_CSR_LPWRRSTF_Pos            (31)
#define RCC_CSR_LPWRRSTF_Msk            (0x01U << RCC_CSR_LPWRRSTF_Pos) /*!< Low power reset flag */

/**
  * @brief RCC_SYSCFG Register Bit Definition
  */
#define RCC_SYSCFG_PROGCHECKEN_Pos      (0)
#define RCC_SYSCFG_PROGCHECKEN_Msk      (0x01U << RCC_SYSCFG_PROGCHECKEN_Pos) /*!< Whether to check the number in Flash when writing to Flash */

#define RCC_SYSCFG_HSERFBSEL_Pos        (8)
#define RCC_SYSCFG_HSERFBSEL_Msk        (0x03U << RCC_SYSCFG_HSERFBSEL_Pos)   /*!< Oscillator feedback resistance trimming */
#define RCC_SYSCFG_HSELPFEN_Pos         (14)
#define RCC_SYSCFG_HSELPFEN_Msk         (0x01U << RCC_SYSCFG_HSELPFEN_Pos)    /*!< Oscillator low pass filtering enable */

/**
  * @brief RCC_CFGR2 Register Bit Definition
  */
#define RCC_CFGR2_TIMADV_CKSEL_Pos      (0)
#define RCC_CFGR2_TIMADV_CKSEL_Msk      (0x01U << RCC_CFGR2_TIMADV_CKSEL_Pos) /*!< TIMADV clock selection */
#define RCC_CFGR2_TIMADV_PRE_Pos        (1)
#define RCC_CFGR2_TIMADV_PRE_Msk        (0x07U << RCC_CFGR2_TIMADV_PRE_Pos)   /*!< TIMADV_CLK prescaler */
#define RCC_CFGR2_TIMADV_PRE_0          (0x00U << RCC_CFGR2_TIMADV_PRE_Pos)   /*!< TIMADV_CLK no division */
#define RCC_CFGR2_TIMADV_PRE_2          (0x04U << RCC_CFGR2_TIMADV_PRE_Pos)   /*!< TIMADV_CLK 2 division */
#define RCC_CFGR2_TIMADV_PRE_4          (0x05U << RCC_CFGR2_TIMADV_PRE_Pos)   /*!< TIMADV_CLK 4 division */
#define RCC_CFGR2_TIMADV_PRE_8          (0x06U << RCC_CFGR2_TIMADV_PRE_Pos)   /*!< TIMADV_CLK 8 division */
#define RCC_CFGR2_TIMADV_PRE_16         (0x07U << RCC_CFGR2_TIMADV_PRE_Pos)   /*!< TIMADV_CLK 16 division */

#define RCC_CFGR2_CANCLKSEL_Pos         (8)
#define RCC_CFGR2_CANCLKSEL_Msk         (0x03U << RCC_CFGR2_CANCLKSEL_Pos)    /*!< FLEXCAN clock selection */
#define RCC_CFGR2_CANCLKSEL_PLL1        (0x00U << RCC_CFGR2_CANCLKSEL_Pos)    /*!< PLL1 */
#define RCC_CFGR2_CANCLKSEL_PLL2        (0x01U << RCC_CFGR2_CANCLKSEL_Pos)    /*!< PLL2 */
#define RCC_CFGR2_CANCLKSEL_HSE         (0x02U << RCC_CFGR2_CANCLKSEL_Pos)    /*!< HSE */

#define RCC_CFGR2_CANPRE_Pos            (12)
#define RCC_CFGR2_CANPRE_Msk            (0x03U << RCC_CFGR2_CANPRE_Pos)       /*!< FLEXCAN prescaler */
#define RCC_CFGR2_CANPRE_1              (0x00U << RCC_CFGR2_CANPRE_Pos)       /*!< FLEXCAN no division */
#define RCC_CFGR2_CANPRE_2              (0x01U << RCC_CFGR2_CANPRE_Pos)       /*!< FLEXCAN 2 division */
#define RCC_CFGR2_CANPRE_3              (0x02U << RCC_CFGR2_CANPRE_Pos)       /*!< FLEXCAN 3 division */
#define RCC_CFGR2_CANPRE_4              (0x03U << RCC_CFGR2_CANPRE_Pos)       /*!< FLEXCAN 4 division */

#define RCC_CFGR2_APB1CLKHVPRE_Pos      (16)
#define RCC_CFGR2_APB1CLKHVPRE_Msk      (0x0FU << RCC_CFGR2_APB1CLKHVPRE_Pos) /*!< APB1_HV output clock division coefficient */
#define RCC_CFGR2_APB1CLKHVPRE_0        (0x01U << RCC_CFGR2_APB1CLKHVPRE_Pos) /*!< Bit 0 */
#define RCC_CFGR2_APB1CLKHVPRE_1        (0x02U << RCC_CFGR2_APB1CLKHVPRE_Pos) /*!< Bit 1 */
#define RCC_CFGR2_APB1CLKHVPRE_2        (0x04U << RCC_CFGR2_APB1CLKHVPRE_Pos) /*!< Bit 2 */
#define RCC_CFGR2_APB1CLKHVPRE_3        (0x08U << RCC_CFGR2_APB1CLKHVPRE_Pos) /*!< Bit 3 */

#define RCC_CFGR2_MCO_PRE_Pos           (20)
#define RCC_CFGR2_MCO_PRE_Msk           (0x0FU << RCC_CFGR2_MCO_PRE_Pos)      /*!< MCO Clock Prescaler Coefficient */
#define RCC_CFGR2_MCO_PRE_0             (0x01U << RCC_CFGR2_MCO_PRE_Pos)      /*!< Bit 0 */
#define RCC_CFGR2_MCO_PRE_1             (0x02U << RCC_CFGR2_MCO_PRE_Pos)      /*!< Bit 1 */
#define RCC_CFGR2_MCO_PRE_2             (0x04U << RCC_CFGR2_MCO_PRE_Pos)      /*!< Bit 2 */
#define RCC_CFGR2_MCO_PRE_3             (0x08U << RCC_CFGR2_MCO_PRE_Pos)      /*!< Bit 3 */

#define RCC_CFGR2_LPUARTCLKSEL_Pos      (26)
#define RCC_CFGR2_LPUARTCLKSEL_Msk      (0x03U << RCC_CFGR2_LPUARTCLKSEL_Pos) /*!< LPUART Clock Source Select */
#define RCC_CFGR2_LPUARTCLKSEL_LSE      (0x00U << RCC_CFGR2_LPUARTCLKSEL_Pos) /*!< LSE_CLK */
#define RCC_CFGR2_LPUARTCLKSEL_LSI      (0x01U << RCC_CFGR2_LPUARTCLKSEL_Pos) /*!< LSI_CLK */
#define RCC_CFGR2_LPUARTCLKSEL_PCLK     (0x02U << RCC_CFGR2_LPUARTCLKSEL_Pos) /*!< PCLK_LPUART */
#define RCC_CFGR2_LPUARTCLKSEL_HSI      (0x03U << RCC_CFGR2_LPUARTCLKSEL_Pos) /*!< HSI_CLK */

#define RCC_CFGR2_LPTIMCLKSEL_Pos       (29)
#define RCC_CFGR2_LPTIMCLKSEL_Msk       (0x03U << RCC_CFGR2_LPTIMCLKSEL_Pos)  /*!< LPUART Clock Source Select */
#define RCC_CFGR2_LPTIMCLKSEL_LSE       (0x00U << RCC_CFGR2_LPTIMCLKSEL_Pos)  /*!< LSE_CLK */
#define RCC_CFGR2_LPTIMCLKSEL_LSI       (0x01U << RCC_CFGR2_LPTIMCLKSEL_Pos)  /*!< LSI_CLK */
#define RCC_CFGR2_LPTIMCLKSEL_PCLK      (0x02U << RCC_CFGR2_LPTIMCLKSEL_Pos)  /*!< PCLK_LPTIM */
#define RCC_CFGR2_LPTIMCLKSEL_HSI       (0x03U << RCC_CFGR2_LPTIMCLKSEL_Pos)  /*!< HSI_CLK */

/**
  * @brief RCC_ICSCR Register Bit Definition
  */
#define RCC_ICSCR_TRIMCRSSEL_Pos        (0)
#define RCC_ICSCR_TRIMCRSSEL_Msk        (0x01U << RCC_ICSCR_TRIMCRSSEL_Pos) /*!< Will HSITRIM value use CRS module as source */

/**
  * @brief RCC_PLL1CFGR Register Bit Definition
  */
#define RCC_PLL1CFGR_PLL1SRC_Pos        (0)
#define RCC_PLL1CFGR_PLL1SRC_Msk        (0x01U << RCC_PLL1CFGR_PLL1SRC_Pos)   /*!< PLL1 Entry Clock Source Selection */
#define RCC_PLL1CFGR_PLL1XTPRE_Pos      (1)
#define RCC_PLL1CFGR_PLL1XTPRE_Msk      (0x01U << RCC_PLL1CFGR_PLL1XTPRE_Pos) /*!< Division selection when HSE clock is used as PLL1 input */
#define RCC_PLL1CFGR_PLL1ICTRL_Pos      (2)
#define RCC_PLL1CFGR_PLL1ICTRL_Msk      (0x03U << RCC_PLL1CFGR_PLL1ICTRL_Pos) /*!< PLL1 CP current control signals */
#define RCC_PLL1CFGR_PLL1LDS_Pos        (4)
#define RCC_PLL1CFGR_PLL1LDS_Msk        (0x07U << RCC_PLL1CFGR_PLL1LDS_Pos)   /*!< PLL1 Lock Detector Accuracy Select */
#define RCC_PLL1CFGR_PLL1LDS_OFF        (0x00U << RCC_PLL1CFGR_PLL1LDS_Pos)   /*!< Turn off accuracy */
#define RCC_PLL1CFGR_PLL1LDS_HIGH       (0x01U << RCC_PLL1CFGR_PLL1LDS_Pos)   /*!< High accuracy */
#define RCC_PLL1CFGR_PLL1LDS_SUBHIGH    (0x02U << RCC_PLL1CFGR_PLL1LDS_Pos)   /*!< Sub-high accuracy */
#define RCC_PLL1CFGR_PLL1LDS_MIDHIGH    (0x03U << RCC_PLL1CFGR_PLL1LDS_Pos)   /*!< Medium high accuracy */
#define RCC_PLL1CFGR_PLL1LDS_MID        (0x04U << RCC_PLL1CFGR_PLL1LDS_Pos)   /*!< Medium accuracy */
#define RCC_PLL1CFGR_PLL1LDS_MIDLOW     (0x05U << RCC_PLL1CFGR_PLL1LDS_Pos)   /*!< Medium-low accuracy */
#define RCC_PLL1CFGR_PLL1LDS_SUBLOW     (0x06U << RCC_PLL1CFGR_PLL1LDS_Pos)   /*!< Sub-low accuracy */
#define RCC_PLL1CFGR_PLL1LDS_LOW        (0x07U << RCC_PLL1CFGR_PLL1LDS_Pos)   /*!< Low accuracy */

#define RCC_PLL1CFGR_PLL1DIV_Pos        (8)
#define RCC_PLL1CFGR_PLL1DIV_Msk        (0x07U << RCC_PLL1CFGR_PLL1DIV_Pos)   /*!< PLL1 Divide Factor */

#define RCC_PLL1CFGR_PLL1MUL_Pos        (16)
#define RCC_PLL1CFGR_PLL1MUL_Msk        (0xFFU << RCC_PLL1CFGR_PLL1MUL_Pos)   /*!< PLL1 Multiplication Factor */

#define RCC_PLL1CFGR_PLL1PDIV_Pos       (24)
#define RCC_PLL1CFGR_PLL1PDIV_Msk       (0x07U << RCC_PLL1CFGR_PLL1PDIV_Pos)  /*!< PLL1 Pre-divide Factor */

/**
  * @brief RCC_PLL2CFGR Register Bit Definition
  */
#define RCC_PLL2CFGR_PLL2SRC_Pos        (0)
#define RCC_PLL2CFGR_PLL2SRC_Msk        (0x01U << RCC_PLL2CFGR_PLL2SRC_Pos)   /*!< PLL2 Entry Clock Source Selection */
#define RCC_PLL2CFGR_PLL2XTPRE_Pos      (1)
#define RCC_PLL2CFGR_PLL2XTPRE_Msk      (0x01U << RCC_PLL2CFGR_PLL2XTPRE_Pos) /*!< Division selection when HSE clock is used as PLL2 input */
#define RCC_PLL2CFGR_PLL2ICTRL_Pos      (2)
#define RCC_PLL2CFGR_PLL2ICTRL_Msk      (0x03U << RCC_PLL2CFGR_PLL2ICTRL_Pos) /*!< PLL2 CP current control signals */
#define RCC_PLL2CFGR_PLL2LDS_Pos        (4)
#define RCC_PLL2CFGR_PLL2LDS_Msk        (0x07U << RCC_PLL2CFGR_PLL2LDS_Pos)   /*!< PLL2 Lock Detector Accuracy Select */
#define RCC_PLL2CFGR_PLL2LDS_OFF        (0x00U << RCC_PLL2CFGR_PLL2LDS_Pos)   /*!< Turn off accuracy */
#define RCC_PLL2CFGR_PLL2LDS_HIGH       (0x01U << RCC_PLL2CFGR_PLL2LDS_Pos)   /*!< High accuracy */
#define RCC_PLL2CFGR_PLL2LDS_SUBHIGH    (0x02U << RCC_PLL2CFGR_PLL2LDS_Pos)   /*!< Sub-high accuracy */
#define RCC_PLL2CFGR_PLL2LDS_MIDHIGH    (0x03U << RCC_PLL2CFGR_PLL2LDS_Pos)   /*!< Medium high accuracy */
#define RCC_PLL2CFGR_PLL2LDS_MID        (0x04U << RCC_PLL2CFGR_PLL2LDS_Pos)   /*!< Medium accuracy */
#define RCC_PLL2CFGR_PLL2LDS_MIDLOW     (0x05U << RCC_PLL2CFGR_PLL2LDS_Pos)   /*!< Medium-low accuracy */
#define RCC_PLL2CFGR_PLL2LDS_SUBLOW     (0x06U << RCC_PLL2CFGR_PLL2LDS_Pos)   /*!< Sub-low accuracy */
#define RCC_PLL2CFGR_PLL2LDS_LOW        (0x07U << RCC_PLL2CFGR_PLL2LDS_Pos)   /*!< Low accuracy */

