YuZane/ExpressTrain/Device/MM32F5330/Include/reg_rcc.h
#define RCC_PLL2CFGR_PLL2DIV_Pos        (8)
#define RCC_PLL2CFGR_PLL2DIV_Msk        (0x07U << RCC_PLL2CFGR_PLL2DIV_Pos)   /*!< PLL2 Divide Factor */

#define RCC_PLL2CFGR_PLL2MUL_Pos        (16)
#define RCC_PLL2CFGR_PLL2MUL_Msk        (0xFFU << RCC_PLL2CFGR_PLL2MUL_Pos)   /*!< PLL2 Multiplication Factor */

#define RCC_PLL2CFGR_PLL2PDIV_Pos       (24)
#define RCC_PLL2CFGR_PLL2PDIV_Msk       (0x07U << RCC_PLL2CFGR_PLL2PDIV_Pos)  /*!< PLL2 Pre-divide Factor */

/**
  * @brief  RCC_ADC1CFGR Register Bit Definition
  */
#define RCC_ADC1CFGR_PRE_Pos            (0)
#define RCC_ADC1CFGR_PRE_Msk            (0x0FU << RCC_ADC1CFGR_PRE_Pos)     /*!< ADC1 prescaler */
#define RCC_ADC1CFGR_PRECAL_Pos         (8)
#define RCC_ADC1CFGR_PRECAL_Msk         (0x1FFU << RCC_ADC1CFGR_PRECAL_Pos) /*!< ADC1 calibration clock division configuration */

/**
  * @brief  RCC_ADC2CFGR Register Bit Definition
  */
#define RCC_ADC2CFGR_PRE_Pos            (0)
#define RCC_ADC2CFGR_PRE_Msk            (0x0FU << RCC_ADC2CFGR_PRE_Pos)     /*!< ADC2 prescaler */
#define RCC_ADC2CFGR_PRECAL_Pos         (8)
#define RCC_ADC2CFGR_PRECAL_Msk         (0x1FFU << RCC_ADC2CFGR_PRECAL_Pos) /*!< ADC2 calibration clock division configuration */

/**
  * @brief  RCC_DACCFGR Register Bit Definition
  */
#define RCC_DACCFGR_PRE_Pos             (0)
#define RCC_DACCFGR_PRE_Msk             (0x7FU << RCC_DACCFGR_PRE_Pos) /*!< DAC prescaler */

/**
  * @brief  RCC_TPIUCFGR Register Bit Definition
  */
#define RCC_TPIUCFGR_PRE_Pos            (0)
#define RCC_TPIUCFGR_PRE_Msk            (0x03U << RCC_TPIUCFGR_PRE_Pos) /*!< TPIU prescaler */
#define RCC_TPIUCFGR_PRE_0              (0x00U << RCC_TPIUCFGR_PRE_Pos) /*!< No division */
#define RCC_TPIUCFGR_PRE_1              (0x01U << RCC_TPIUCFGR_PRE_Pos) /*!< 2 division */
#define RCC_TPIUCFGR_PRE_2              (0x02U << RCC_TPIUCFGR_PRE_Pos) /*!< 3 division */
#define RCC_TPIUCFGR_PRE_3              (0x03U << RCC_TPIUCFGR_PRE_Pos) /*!< 4 division */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------*/
#endif
/** --------------------------------------------------------------------------*/

